label lobby:
    window hide
    $ quick_menu = False
    if persistent.clue[11] and persistent.clue[12] and persistent.lobby_sw_flag and persistent.lobby_wf_flag and persistent.lobby_lmm_flag:
        jump c2_2_extra
    else:
        show screen lobby_screen
        pause
        jump lobby
    return


define loc_lobby = [
    {
        "name": "大厅-箭头",
        "idle_image": "images/map/star_idle.png",
        "hover_image": "images/map/star_hover.png",
        "label": "lobby_sign",
        "xpos": 1492,
        "ypos": 116
    },
    {
        "name": "大厅-日历",
        "idle_image": "images/map/star_idle.png",
        "hover_image": "images/map/star_hover.png",
        "label": "lobby_calender",
        "xpos": 1375,
        "ypos": 295
    },
    {
        "name": "姒舞",
        "idle_image": "images/map/qsw_idle.webp",
        "hover_image": "images/map/qsw_hover.webp",
        "label": "lobby_sw",
        "xpos": 503,
        "ypos": 652
    },
    {
        "name": "梁绵绵",
        "idle_image": "images/map/qlmm_idle.webp",
        "hover_image": "images/map/qlmm_hover.webp",
        "label": "lobby_lmm",
        "xpos": 1452,
        "ypos": 601
    },
    {
        "name": "卫锋",
        "idle_image": "images/map/qwf_idle.webp",
        "hover_image": "images/map/qwf_hover.webp",
        "label": "lobby_wf",
        "xpos": 28,
        "ypos": 499
    },
]

screen lobby_screen:
    modal True
    add "images/map/lobby.webp"

    # buttons for each location
    for location in loc_lobby:
        imagebutton:
            idle location["idle_image"]
            hover location["hover_image"]
            xpos location["xpos"]
            ypos location["ypos"]
            action [Hide("lobby_screen"), Jump(location["label"])]

init:
    define persistent.lobby_sw_flag = 0
    define persistent.lobby_lmm_flag = 0
    define persistent.lobby_wf_flag = 0


label lobby_sign:
    $ persistent.clue[11] = 1
    "墙面上贴着指向标的图样。好几个箭头，标注了不同方向的信息。左侧是游戏室、茶水间、后花园，右侧是电影房和卫生间。从正中间往里，则是巨大的宴会厅。"
    by "这里看起来好大啊，竟然有这么多房间。"
    me "从外面能看出来，这里的建筑占地面积就不小。"
    by "啧……住在这里肯定很舒服。"
    me "这不是现在可以体验一次嘛。"
    by "……虽然你说得有道理。"
    by "但不知道为什么，总感觉好像更不爽了。"
    by "都怪你。"
    me "……关我什么事啊？"
    "总感觉这人跟我说话越来越放飞自我了……"
    jump lobby
    return

label lobby_calender:
    $ persistent.clue[12] = 1
    "墙上挂着日历，停留在这个月的页面。设计灵动，装帧精美，配上美丽的纹样，当作装饰也毫不突兀。1月1日的地方用记号笔圈出一个大大的圆圈，旁边标有手写的笔记“17岁生日”。"
    by "这么隆重。"
    me "都叫了这么多人来，直接搞派对了。"
    by "哦……也是。"
    by "还挺新奇的。应该会吃得很好吧？"
    "白一说着，甚至吸溜了一下口水。"
    me "喂……"
    "感受到那份饥饿感，我甚至也想跟着吸溜一下。"
    me "话说你生日是什么时候？"
    "为了不让饥饿感充斥大脑，我赶紧转移注意力。"
    by "啊？好像是……这个月吧。"
    by "16号？还是18号？不，好像是23号……"
    by "呃，嗯，差不多啦。"
    me "？"
    me "你自己的生日，你都记不清的吗？"
    me "等等，那不是已经过了吗？"
    "我大为震撼。"
    by "对啊，所以呢？"
    me "那……你当时都没说过啊？"
    by "我都不记得，怎么说啊。"
    me "……"
    "她说得好有道理，我竟然无法反驳……"
    me "但……呃……就是……生日不是都很重要的嘛？"
    by "是吗？"
    "我有些弱弱地开口，但白一只是不咸不淡地回应。"
    by "我好像没什么感觉。"
    by "不过我知道我今年过的17岁生日。"
    me "那……你好棒棒？"
    by "那是。"
    "白一轻哼一声，得意地笑了。"
    "这有什么好得意的啊……"
    "虽然这么想，但我也不自觉跟她一起笑了出来。"
    jump lobby
    return

label lobby_sw:
    $ persistent.lobby_sw_flag = 1
    "姒舞坐在一张小圆桌旁边的沙发上，和旁边的人有说有笑。不知为何，她身上 像是装了雷达似的，白一的眼神扫过去时，她正好转过了头。四目相对。"
    by "……靠！"
    "白一立马收回目光，假装刚刚什么都没看到，什么都没发生。"
    "身体转开，脚下已经开始动作，保持着平稳的步伐往另一个方向走。"
    "只是——"
    sw "白一~"
    "姒舞一如往常的热情，很快就朝着白一的方向走来。"
    by "我没听见我没听见……"
    "白一不回头，开始自欺欺人。"
    sw "白一！你明明就看到我了。"
    by "……嘶。"
    "姒舞从白一的正前方冒出来，令白一不得不停住了脚步。"
    sw "我还以为你不来了，人家好失望的呢。"
    by "……"
    sw "怎么样？我是不是很厉害，在天玉的场合里一样很受欢迎哦。"
    by "……"
    "白一用余光瞥了瞥沙发那侧的人，极其无奈地叹了口气。"
    by "那你更不应该来找我。"
    sw "欸——为什么啊？"
    by "难道，你没发现其他人都很讨厌我吗？"
    by "跟我一起，影响你社交小天才的路。"
    sw "不……"
    "姒舞看了看周围，许多隐晦打量的眼神飘过来，又因为她的转头飘走。"
    "她瘪了瘪嘴，似乎意识到不同寻常的气氛，也看出白一的不情愿。"
    by "这样你绝对比不过天玉。"
    "白一用她讨厌的人当理由，却没想到姒舞只是哼了一声。"
    sw "我是讨厌她，但也没想着要靠你跟别人打好关系……那跟霸凌有什么区别？"
    by "……也没那么严重吧。"
    by "无所谓啊，又不是你主动害我。"
    by "而且其他人也没做什么，他们不喜欢我，我也不喜欢他们，都很正常的。"
    sw "可是……那种眼神就很奇怪啊……"
    sw "要是只是普通的不喜欢，为什么要一起弄出那种氛围呢……"
    by "……"
    sw "但……如果你真的不想的话……"
    "面对沉默的白一，姒舞的声音也逐渐变低。"
    by "……"
    by "所以你啊，干嘛非要找我？"
    sw "就是想跟你说说话啊。"
    by "……你有那么多朋友还不够说啊？"
    "白一是真的很震惊，平淡如水的语气都有了些起伏。"
    sw "不是，这怎么能一样呢？"
    "姒舞举起手，认真地跟白一解释。"
    sw "她们又不是你的替代品，你也不是她们的替代品啊。"
    sw "每个人都不一样的。"
    sw "找你，也是因为喜欢跟你聊天的感觉啊。"
    by "……"
    by "你说话真的有点中二。"
    me "噗——"
    sw "哇，我那么认真，你竟然这样说？"
    by "……实话实说？"
    sw "哼。"
    sw "反正我都在这里了，你就跟我聊聊嘛。"
    sw "我保证之后就不在这主动找你了。"
    by "……哦。"
    "白一最终还是没再说拒绝的话。"
    "不过……毕竟她也不能直接把人赶走就是了。"
    sw "我跟你说哦，那边竟然有个游戏室，有超多游戏的。好羡慕~有钱真好~"
    by "确实……有钱真好。"
    by "租这么大的场地肯定很贵。"
    sw "欸，我不是这个意思。"
    by "啊？"
    sw "你不知道吗？天玉她全名叫云天玉哦。"
    by "呃……云天玉？"
    sw "那你记得这地方叫什么名字嘛？"
    me "……好像叫云玉阁。"
    by "……靠。"
    by "有钱真好。"
    "见白一似乎已经想起来，姒舞点了点头。"
    sw "对吧？是大小姐欸，真讨厌~"
    "白一扶了扶额头，只觉得自己好像也有点讨厌天玉了。"
    "不过……纯粹是因为仇富之类的……倒没有姒舞那好像很复杂的爱恨情仇。"
    by "你那么讨厌天玉，竟然不叫她全名。"
    sw "一码归一码咯。她放出来的名字是这个，那当然要尊重。"
    sw "毕竟名字很重要的啊。"
    by "……是哦。"    
    jump lobby
    return

label lobby_lmm:
    $ persistent.lobby_lmm_flag = 1
    "梁绵绵独自坐在角落，一条腿伸得很直，是个不太自然的姿势。她的眼神止不住东张西望，似乎在寻找什么。"
    by "说起来，之前都还没去跟她道歉……主要是总找不到机会。"
    by "不过我竟然没有被家长找上门，也没被骂个狗血淋头。"
    by "真神奇。"
    me "那说明她应该挺好人的吧。"
    by "所以我就是很坏人咯。啊……虽然感觉也没说错……"
    me "我可没有那个意思啊……"
    by "行，行。"
    me "不过，现在不是正好吗，去跟她说呗？"
    by "现在？合适吗，她好像在找人？"
    me "等她找到了更不方便吧，现在她还一个人坐着。"
    by "呃……好吧，有道理。"
    "白一略微思索一下，还是朝着她走了过去。"
    lmm "……白一？"
    "听到动静，梁绵绵转过头来，眼神里是明显的惊讶。"
    by "啊，对，是我。"
    by "就是……之前体育测试的事，对不起了。"
    "白一不太自然地卡了卡壳，才慢慢地把话说完。"
    "她很少有这么结实平和的语气，也更少会有说对不起这句话的场合。"
    "尽管听起来很干巴巴，但大概已经很认真了。"
    lmm "噢，你说那个啊，没事的。"
    by "但你受伤很严重啊，哪里没事了。"
    by "我应该要赔偿吧？让我赔偿。"
    me "哇，你是怎么把赔偿说得像讨债的？"
    "她的语气实在过于生硬，配上冷淡的表情和居高临下看着梁绵绵的角度，让我幻视某些不和谐的画面。"
    by "……啧。"
    "白一轻轻磨了磨牙，左手狠狠地在腿上捏了一把。"
    me "噫！"
    lmm "你说严重……可是已经看过医生，涂过药了。"
    lmm "而且，我以前是体育生，经常受伤的。"
    lmm "真的没事啦。"
    "白一微微拧起眉毛，似乎是不理解梁绵绵的行为。"
    by "这是我应该做的啊。"
    by "哦，如果你是不想跟我这种人多牵扯的话，找个中间人也可以。"
    "她的语气开始变得不耐烦，但梁绵绵仍然只是笑笑，弯起了眼睛。"
    lmm "不是在说你……腿的问题只是需要时间恢复，过段时间就好了。"
    lmm "那要不这样吧，你帮我做一件别的事情。"
    by "你先说。"
    lmm "就……可以祝我接下来做的事情都一切顺利吗？"
    by "……？"
    by "这算什么？"
    lmm "嗯，就是真心的祝福啊。"
    lmm "你不是想补偿我吗？真心祝福我，就是最好的补偿啦。"
    by "……"
    by "无法理解……"
    "白一小声嘀咕着，但还是叹了口气，点点头。"
    by "好吧……我尽量。"
    by "那就——咳咳……"
    by "祝你顺利……祝你一切都顺利。"
    lmm "谢谢你呀。"
    "梁绵绵再次笑了，看上去是真的很开心。"
    "这样就好……白一这才缓缓吐了口气，把悬着的心放下。"
    by "人不可貌相啊。"
    me "嗯？"
    "这似乎是我也想说过的话，只是没想到会先一步从她嘴里说出来。"
    by "没想到梁绵绵说话是那种风格？"
    by "她那么高，看起来就很能打，不是还说以前是体育生吗……"
    by "我伤了她，结果她竟然一点都不凶。"
    by "甚至还挺温柔……真离谱。"
    "白一叹了口气，小声地唠唠叨叨，我忍不住八卦起来。"
    me "哦，原来你喜欢温柔的呀？"
    by "我靠，说什么呢？"
    me "难道不是嘛，温柔的大姐姐，不好吗？"
    me "你都没骂过人家诶。"
    by "……拜托，你在说什么白痴话？"
    by "首先，她比我小，是跳级上学的。"
    by "其次，我虽然没素质，没心没肺，冷血自私，孤僻阴暗……"
    "白一一连说了好几个形容词，才堪堪停下来。"
    by "但不至于到人渣的程度好吗？恩将仇报？"
    me "噗……我开玩笑的……"
    "不过，虽然她这么说，但我能从白一的情绪感觉到，她比之前放松了许多。"
    by "而且，你不要说得好像我经常骂人一样。"
    me "……难道没有吗？"
    by "难道有吗？"
    "她毫不迟疑地反问我，反倒让我怀疑起自己来……"
    jump lobby
    return

label lobby_wf:
    $ persistent.lobby_wf_flag = 1
    "白一的目光扫过去的时候，正好看到班长从左侧的方向走出来。她手里拿着一个魔方，看到白一时，迅速低下头，一边摆弄着手里的魔方一边走开了。"
    by "……"
    by "靠。"
    by "虽然她不来烦我我很高兴，但还是有种莫名的不爽。"
    by "总感觉她在用一种很讨厌的眼神看我。"
    me "嗯？啊……也很正常啦。"
    "毕竟不管再怎么说，被人直白地讨厌当然不会令人高兴。"
    by "不是你想的那样。"
    by "我才不在意她讨厌我，毕竟我也不喜欢她。"
    by "但很明显她讨厌我是因为温心，这就很烦了。"
    by "有一种替人背了黑锅的感觉。"
    me "……那也没有什么办法。"
    by "哼。"
    by "好学生班长，竟然也会露出这种表情。"
    "白一不知道该用什么心情。"
    "该说是感慨呢？还是佩服呢？"
    "在温心死后，还有一个人念着她，为她的死亡生气，希望找到凶手。"
    "不是像白一这样有利可图，而是……发自真心？"
    jump lobby
    return